specs/loadTestGet.yml
config:
  target: 'http://localhost:3003'
  ensure:
    maxErrorRate: 1
  phases:
    - duration: 20
      arrivalRate: 5
      rampTo: 99
      name: "warm up"
    - duration: 10
      arrivalRate: 100
      name: "phase 1"
    - duration: 10
      arrivalRate: 200
      name: "phase 2"
    - duration: 10
      arrivalRate: 300
      name: "phase 3"
    - duration: 10
      arrivalRate: 400
      name: "phase 4"
    - duration: 10
      arrivalRate: 500
      name: "phase 5"
    - duration: 10
      arrivalRate: 750
      name: "phase 6"
    - duration: 10
      arrivalRate: 1500
      name: "phase 7"
    - duration: 600
      arrivalRate: 2000
      name: "phase 8"
scenarios:
  - flow:
    - get:
        url: "/listings"